tap "adoptopenjdk/openjdk"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
brew "gdbm"
brew "openssl@1.1"
brew "readline"
brew "autojump"
brew "automake"
brew "bat"
brew "bazel"
brew "bison"
brew "blueutil"
brew "gettext"
brew "libffi"
brew "glib"
brew "chruby"
brew "circleci"
brew "cocoapods"
brew "exa"
brew "fd"
brew "gnutls"
brew "harfbuzz"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "go"
brew "gradle-completion"
brew "grip"
brew "highlight"
brew "htop"
brew "hugo"
brew "libusbmuxd"
brew "libimobiledevice", args: ["HEAD"]
brew "ideviceinstaller"
brew "imagemagick"
brew "ios-deploy"
brew "jq"
brew "kotlin"
brew "ktlint"
brew "lazygit"
brew "libyaml"
brew "mkdocs"
brew "neovim"
brew "nnn"
brew "nvm"
brew "prototool"
brew "repo"
brew "ripgrep"
brew "rsync"
brew "ruby"
brew "ruby-install"
brew "rustup-init"
brew "shellcheck"
brew "shfmt"
brew "starship"
brew "tldr"
brew "tmux"
brew "tree"
brew "unrar"
brew "vim"
brew "wget"
brew "zola"
cask "adoptopenjdk11"
cask "adoptopenjdk8"
cask "google-cloud-sdk"
cask "java"
cask "karabiner-elements"
cask "postman"
cask "sourcetree"
