tap "adoptopenjdk/openjdk"
tap "aws/tap"
tap "dart-lang/dart"
tap "denisidoro/tools"
tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "nektos/tap"
cask "adoptopenjdk8"
brew "gdbm"
brew "openssl@1.1"
brew "readline"
brew "asciinema"
brew "autojump"
brew "automake"
brew "bat"
brew "bazel"
brew "bison"
brew "blueutil"
brew "libffi"
brew "glib"
brew "chruby"
brew "circleci"
brew "cocoapods"
brew "exa"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "git"
brew "git-delta"
brew "go"
brew "grip"
brew "highlight"
brew "htop"
brew "hugo"
brew "libusbmuxd", args: ["HEAD"]
brew "libimobiledevice", args: ["HEAD"]
brew "ideviceinstaller"
brew "imagemagick"
brew "ios-deploy"
brew "jq"
brew "kotlin"
brew "ktlint"
brew "lazygit"
brew "libyaml"
brew "lsof"
brew "neovim"
brew "nmap"
brew "nnn"
brew "nvm"
brew "openapi-generator"
brew "pipenv"
brew "prototool"
brew "repo"
brew "ripgrep"
brew "rsync"
brew "ruby-install"
brew "rustup-init"
brew "shellcheck"
brew "shfmt"
brew "starship"
brew "svgo"
brew "tldr"
brew "tmux"
brew "tree"
brew "unrar"
brew "vim"
brew "wget"
brew "zola"
brew "aws/tap/aws-sam-cli"
brew "dart-lang/dart/dart"
brew "denisidoro/tools/navi"
brew "github/gh/gh"
brew "nektos/tap/act"
cask "alfred"
cask "google-cloud-sdk"
cask "iterm2"
cask "java"
cask "karabiner-elements"
cask "postman"
cask "sourcetree"
