# .zsh_plugins.txt - Antidote static plugin configuration
# This file is used to generate .zsh_plugins.zsh for faster loading

# Load Oh-My-Zsh library and plugins
getantidote/use-omz
ohmyzsh/ohmyzsh path:lib
ohmyzsh/ohmyzsh path:plugins/brew
ohmyzsh/ohmyzsh path:plugins/git
ohmyzsh/ohmyzsh path:plugins/starship
ohmyzsh/ohmyzsh path:plugins/eza
ohmyzsh/ohmyzsh path:plugins/gitignore
ohmyzsh/ohmyzsh path:plugins/uv
ohmyzsh/ohmyzsh path:plugins/command-not-found

# Enhancement plugins
zsh-users/zsh-completions path:src kind:fpath
zsh-users/zsh-autosuggestions kind:defer
zdharma-continuum/fast-syntax-highlighting kind:defer
Aloxaf/fzf-tab

# Local plugins (listed individually because they don't follow plugin naming convention)
$HOME/.zshconfig/plugins/android.zsh
$HOME/.zshconfig/plugins/ffmpeg.zsh
$HOME/.zshconfig/plugins/flutter.zsh
$HOME/.zshconfig/plugins/fnm.zsh
$HOME/.zshconfig/plugins/fzf.zsh
$HOME/.zshconfig/plugins/ios.zsh
$HOME/.zshconfig/plugins/java.zsh
$HOME/.zshconfig/plugins/kotlin.zsh
$HOME/.zshconfig/plugins/rg.zsh
$HOME/.zshconfig/plugins/zoxide.zsh
